Repository: y1feng200156/dlw
Catalog: WK-level2.tmx
Source language: en_us
Languages: zh_cn

source: For a recent hackathon that we did at STATWORX , some of our team members scraped minutely S&P 500 data from the Google Finance API.
zh_cn: 最近在 STATWORX 举办的黑客节，我们的团队从 Google Finance API 中拉取了每分钟的 S&P 500 数据。

source: Having this data at hand, the idea of developing a deep learning model for predicting the S&P 500 index based on the 500 constituents prices one minute ago came immediately on my mind.
zh_cn: 有了这些数据后，我立即想到了一个点子：基于 S&P 500 的 500 家企业股价，建立一个深度学习模型，预测 S&P 500 指数。

source: Note, that this story is a hands-on tutorial on TensorFlow.
zh_cn: 备注，这是基于 TensorFlow 的实战教程。

source: Playing around with the data and building the deep learning model with TensorFlow was fun and so I decided to write my first Medium.com story: a little TensorFlow tutorial on predicting S&P 500 stock prices.
zh_cn: 把玩这些数据来构建 TensorFlow 深度学习模型很有趣，所以我决定写我的第一个 Medium.com 文章：基于 TensorFlow 的股票价格预测深度学习模型。

source: The Python code I ’ ve created is not optimized for efficiency but understandability.
zh_cn: 我编写的代码没有做效率优化，但是可读性还不错。

source: The data consisted of index as well as stock prices of the S&P ’ s 500 constituents.
zh_cn: 这些数据包含了 S&P 500 的指数以及其企业的股价。

source: The dataset I ’ ve used can be downloaded from here (40MB).
zh_cn: 我使用的数据可以在 这里 下载 (40MB)。

source: What you will read is not an in-depth tutorial, but more a high-level introduction to the important building blocks and concepts of TensorFlow models.
zh_cn: 您将阅读的不是一个深入的教程，而是更高层次的介绍 TensorFlow 的重要构建组件和概念。

source: A simple deep learning model for stock price prediction using TensorFlow
zh_cn: 基于 TensorFlow 实现股票价格预测深度学习模型
